Masmiseim36/iMXRT/targets/iMXRText/devices/iMXRT1160/periph/PERI_OCOTP.h
/*! @name CTRL_TOG - OTP Controller Control and Status Register */
/*! @{ */

#define OCOTP_CTRL_TOG_ADDR_MASK                 (0x3FFU)
#define OCOTP_CTRL_TOG_ADDR_SHIFT                (0U)
/*! ADDR - OTP write and read access address register */
#define OCOTP_CTRL_TOG_ADDR(x)                   (((uint32_t)(((uint32_t)(x)) << OCOTP_CTRL_TOG_ADDR_SHIFT)) & OCOTP_CTRL_TOG_ADDR_MASK)

#define OCOTP_CTRL_TOG_BUSY_MASK                 (0x400U)
#define OCOTP_CTRL_TOG_BUSY_SHIFT                (10U)
/*! BUSY - OTP controller status bit */
#define OCOTP_CTRL_TOG_BUSY(x)                   (((uint32_t)(((uint32_t)(x)) << OCOTP_CTRL_TOG_BUSY_SHIFT)) & OCOTP_CTRL_TOG_BUSY_MASK)

#define OCOTP_CTRL_TOG_ERROR_MASK                (0x800U)
#define OCOTP_CTRL_TOG_ERROR_SHIFT               (11U)
/*! ERROR - Locked Region Access Error */
#define OCOTP_CTRL_TOG_ERROR(x)                  (((uint32_t)(((uint32_t)(x)) << OCOTP_CTRL_TOG_ERROR_SHIFT)) & OCOTP_CTRL_TOG_ERROR_MASK)

#define OCOTP_CTRL_TOG_RELOAD_SHADOWS_MASK       (0x1000U)
#define OCOTP_CTRL_TOG_RELOAD_SHADOWS_SHIFT      (12U)
/*! RELOAD_SHADOWS - Reload Shadow Registers */
#define OCOTP_CTRL_TOG_RELOAD_SHADOWS(x)         (((uint32_t)(((uint32_t)(x)) << OCOTP_CTRL_TOG_RELOAD_SHADOWS_SHIFT)) & OCOTP_CTRL_TOG_RELOAD_SHADOWS_MASK)

#define OCOTP_CTRL_TOG_WORDLOCK_MASK             (0x8000U)
#define OCOTP_CTRL_TOG_WORDLOCK_SHIFT            (15U)
/*! WORDLOCK - Lock fuse word */
#define OCOTP_CTRL_TOG_WORDLOCK(x)               (((uint32_t)(((uint32_t)(x)) << OCOTP_CTRL_TOG_WORDLOCK_SHIFT)) & OCOTP_CTRL_TOG_WORDLOCK_MASK)

#define OCOTP_CTRL_TOG_WR_UNLOCK_MASK            (0xFFFF0000U)
#define OCOTP_CTRL_TOG_WR_UNLOCK_SHIFT           (16U)
/*! WR_UNLOCK - Write unlock */
#define OCOTP_CTRL_TOG_WR_UNLOCK(x)              (((uint32_t)(((uint32_t)(x)) << OCOTP_CTRL_TOG_WR_UNLOCK_SHIFT)) & OCOTP_CTRL_TOG_WR_UNLOCK_MASK)
/*! @} */

/*! @name PDN - OTP Controller PDN Register */
/*! @{ */

#define OCOTP_PDN_PDN_MASK                       (0x1U)
#define OCOTP_PDN_PDN_SHIFT                      (0U)
/*! PDN - PDN value
 *  0b0..OTP memory is not powered
 *  0b1..OTP memory is powered
 */
#define OCOTP_PDN_PDN(x)                         (((uint32_t)(((uint32_t)(x)) << OCOTP_PDN_PDN_SHIFT)) & OCOTP_PDN_PDN_MASK)
/*! @} */

/*! @name DATA - OTP Controller Write Data Register */
/*! @{ */

#define OCOTP_DATA_DATA_MASK                     (0xFFFFFFFFU)
#define OCOTP_DATA_DATA_SHIFT                    (0U)
/*! DATA - Data */
#define OCOTP_DATA_DATA(x)                       (((uint32_t)(((uint32_t)(x)) << OCOTP_DATA_DATA_SHIFT)) & OCOTP_DATA_DATA_MASK)
/*! @} */

/*! @name READ_CTRL - OTP Controller Read Control Register */
/*! @{ */

#define OCOTP_READ_CTRL_READ_FUSE_MASK           (0x1U)
#define OCOTP_READ_CTRL_READ_FUSE_SHIFT          (0U)
/*! READ_FUSE - Read Fuse
 *  0b0..Do not initiate a read from OTP
 *  0b1..Initiate a read from OTP
 */
#define OCOTP_READ_CTRL_READ_FUSE(x)             (((uint32_t)(((uint32_t)(x)) << OCOTP_READ_CTRL_READ_FUSE_SHIFT)) & OCOTP_READ_CTRL_READ_FUSE_MASK)

#define OCOTP_READ_CTRL_READ_FUSE_CNTR_MASK      (0x6U)
#define OCOTP_READ_CTRL_READ_FUSE_CNTR_SHIFT     (1U)
/*! READ_FUSE_CNTR - Number of words to read.
 *  0b00..1 word
 *  0b01..2 words
 *  0b10..3 words
 *  0b11..4 words
 */
#define OCOTP_READ_CTRL_READ_FUSE_CNTR(x)        (((uint32_t)(((uint32_t)(x)) << OCOTP_READ_CTRL_READ_FUSE_CNTR_SHIFT)) & OCOTP_READ_CTRL_READ_FUSE_CNTR_MASK)

#define OCOTP_READ_CTRL_READ_FUSE_DONE_INTR_ENA_MASK (0x8U)
#define OCOTP_READ_CTRL_READ_FUSE_DONE_INTR_ENA_SHIFT (3U)
/*! READ_FUSE_DONE_INTR_ENA - Enable read-done interrupt
 *  0b0..Disable
 *  0b1..Enable
 */
#define OCOTP_READ_CTRL_READ_FUSE_DONE_INTR_ENA(x) (((uint32_t)(((uint32_t)(x)) << OCOTP_READ_CTRL_READ_FUSE_DONE_INTR_ENA_SHIFT)) & OCOTP_READ_CTRL_READ_FUSE_DONE_INTR_ENA_MASK)

#define OCOTP_READ_CTRL_READ_FUSE_ERROR_INTR_ENA_MASK (0x10U)
#define OCOTP_READ_CTRL_READ_FUSE_ERROR_INTR_ENA_SHIFT (4U)
/*! READ_FUSE_ERROR_INTR_ENA - Enable read-error interrupt
 *  0b0..Disable
 *  0b1..Enable
 */
#define OCOTP_READ_CTRL_READ_FUSE_ERROR_INTR_ENA(x) (((uint32_t)(((uint32_t)(x)) << OCOTP_READ_CTRL_READ_FUSE_ERROR_INTR_ENA_SHIFT)) & OCOTP_READ_CTRL_READ_FUSE_ERROR_INTR_ENA_MASK)
/*! @} */

/*! @name OUT_STATUS - 8K OTP Memory STATUS Register */
/*! @{ */

#define OCOTP_OUT_STATUS_SEC_MASK                (0x200U)
#define OCOTP_OUT_STATUS_SEC_SHIFT               (9U)
/*! SEC - Single Error Correct */
#define OCOTP_OUT_STATUS_SEC(x)                  (((uint32_t)(((uint32_t)(x)) << OCOTP_OUT_STATUS_SEC_SHIFT)) & OCOTP_OUT_STATUS_SEC_MASK)

#define OCOTP_OUT_STATUS_DED_MASK                (0x400U)
#define OCOTP_OUT_STATUS_DED_SHIFT               (10U)
/*! DED - Double error detect */
#define OCOTP_OUT_STATUS_DED(x)                  (((uint32_t)(((uint32_t)(x)) << OCOTP_OUT_STATUS_DED_SHIFT)) & OCOTP_OUT_STATUS_DED_MASK)

#define OCOTP_OUT_STATUS_LOCKED_MASK             (0x800U)
#define OCOTP_OUT_STATUS_LOCKED_SHIFT            (11U)
/*! LOCKED - Word Locked */
#define OCOTP_OUT_STATUS_LOCKED(x)               (((uint32_t)(((uint32_t)(x)) << OCOTP_OUT_STATUS_LOCKED_SHIFT)) & OCOTP_OUT_STATUS_LOCKED_MASK)

#define OCOTP_OUT_STATUS_PROGFAIL_MASK           (0x1000U)
#define OCOTP_OUT_STATUS_PROGFAIL_SHIFT          (12U)
/*! PROGFAIL - Programming failed */
#define OCOTP_OUT_STATUS_PROGFAIL(x)             (((uint32_t)(((uint32_t)(x)) << OCOTP_OUT_STATUS_PROGFAIL_SHIFT)) & OCOTP_OUT_STATUS_PROGFAIL_MASK)

#define OCOTP_OUT_STATUS_ACK_MASK                (0x2000U)
#define OCOTP_OUT_STATUS_ACK_SHIFT               (13U)
/*! ACK - Acknowledge */
#define OCOTP_OUT_STATUS_ACK(x)                  (((uint32_t)(((uint32_t)(x)) << OCOTP_OUT_STATUS_ACK_SHIFT)) & OCOTP_OUT_STATUS_ACK_MASK)

#define OCOTP_OUT_STATUS_PWOK_MASK               (0x4000U)
#define OCOTP_OUT_STATUS_PWOK_SHIFT              (14U)
/*! PWOK - Power OK */
#define OCOTP_OUT_STATUS_PWOK(x)                 (((uint32_t)(((uint32_t)(x)) << OCOTP_OUT_STATUS_PWOK_SHIFT)) & OCOTP_OUT_STATUS_PWOK_MASK)

#define OCOTP_OUT_STATUS_FLAGSTATE_MASK          (0x78000U)
#define OCOTP_OUT_STATUS_FLAGSTATE_SHIFT         (15U)
/*! FLAGSTATE - Flag state */
#define OCOTP_OUT_STATUS_FLAGSTATE(x)            (((uint32_t)(((uint32_t)(x)) << OCOTP_OUT_STATUS_FLAGSTATE_SHIFT)) & OCOTP_OUT_STATUS_FLAGSTATE_MASK)

#define OCOTP_OUT_STATUS_SEC_RELOAD_MASK         (0x80000U)
#define OCOTP_OUT_STATUS_SEC_RELOAD_SHIFT        (19U)
/*! SEC_RELOAD - Indicates single error correction occured on reload */
#define OCOTP_OUT_STATUS_SEC_RELOAD(x)           (((uint32_t)(((uint32_t)(x)) << OCOTP_OUT_STATUS_SEC_RELOAD_SHIFT)) & OCOTP_OUT_STATUS_SEC_RELOAD_MASK)

#define OCOTP_OUT_STATUS_DED_RELOAD_MASK         (0x100000U)
#define OCOTP_OUT_STATUS_DED_RELOAD_SHIFT        (20U)
/*! DED_RELOAD - Indicates double error detection occured on reload */
#define OCOTP_OUT_STATUS_DED_RELOAD(x)           (((uint32_t)(((uint32_t)(x)) << OCOTP_OUT_STATUS_DED_RELOAD_SHIFT)) & OCOTP_OUT_STATUS_DED_RELOAD_MASK)

#define OCOTP_OUT_STATUS_CALIBRATED_MASK         (0x200000U)
#define OCOTP_OUT_STATUS_CALIBRATED_SHIFT        (21U)
/*! CALIBRATED - Calibrated status */
#define OCOTP_OUT_STATUS_CALIBRATED(x)           (((uint32_t)(((uint32_t)(x)) << OCOTP_OUT_STATUS_CALIBRATED_SHIFT)) & OCOTP_OUT_STATUS_CALIBRATED_MASK)

#define OCOTP_OUT_STATUS_READ_DONE_INTR_MASK     (0x400000U)
#define OCOTP_OUT_STATUS_READ_DONE_INTR_SHIFT    (22U)
/*! READ_DONE_INTR - Read fuse done */
#define OCOTP_OUT_STATUS_READ_DONE_INTR(x)       (((uint32_t)(((uint32_t)(x)) << OCOTP_OUT_STATUS_READ_DONE_INTR_SHIFT)) & OCOTP_OUT_STATUS_READ_DONE_INTR_MASK)

#define OCOTP_OUT_STATUS_READ_ERROR_INTR_MASK    (0x800000U)
#define OCOTP_OUT_STATUS_READ_ERROR_INTR_SHIFT   (23U)
/*! READ_ERROR_INTR - Fuse read error
 *  0b0..Read operation finished with out any error
 *  0b1..Read operation finished with an error
 */
#define OCOTP_OUT_STATUS_READ_ERROR_INTR(x)      (((uint32_t)(((uint32_t)(x)) << OCOTP_OUT_STATUS_READ_ERROR_INTR_SHIFT)) & OCOTP_OUT_STATUS_READ_ERROR_INTR_MASK)

#define OCOTP_OUT_STATUS_DED0_MASK               (0x1000000U)
#define OCOTP_OUT_STATUS_DED0_SHIFT              (24U)
/*! DED0 - Double error detect */
#define OCOTP_OUT_STATUS_DED0(x)                 (((uint32_t)(((uint32_t)(x)) << OCOTP_OUT_STATUS_DED0_SHIFT)) & OCOTP_OUT_STATUS_DED0_MASK)

#define OCOTP_OUT_STATUS_DED1_MASK               (0x2000000U)
#define OCOTP_OUT_STATUS_DED1_SHIFT              (25U)
/*! DED1 - Double error detect */
#define OCOTP_OUT_STATUS_DED1(x)                 (((uint32_t)(((uint32_t)(x)) << OCOTP_OUT_STATUS_DED1_SHIFT)) & OCOTP_OUT_STATUS_DED1_MASK)

